{
  "NAVBAR": {
    "ABOUT_ME": "About me",
    "SKILLS": "Skills",
    "PORTFOLIO": "Portfolio"
  },
  "HEADER": {
    "FIRST": "Developer",
    "SECOND": "Scroll down"
  },
  "ABOUTME": {
    "FIRST": "ABOUT ME",
    "SECOND": "I am a frontend developer from Kerpen, Germany. I have experience in developing web applications and browser games.",
    "THIRD": "My curiosity drives me to get the best results from the projects and to continuously improve my knowledge.",
    "FOUR": "My precise and calm manner under pressure shows my efficiency in time management to complete projects on time.",
    "FIVE": "Let's talk."
  },
  "MYSKILLS": {
    "FIRST": "My Skills"
  },
  "PORTFOLIO": {
    "FIRST": "Here is a selection of my projects, feel free to see them in action to see my skills."
  },
  "PROJECT1": {
    "FIRST": "Task manager inspired by the Kanban system. Create and organize tasks with drag and drop features, assign users and categories."
  },
  "PROJECT2": {
    "FIRST": "A simple jump-and-run game with an object-oriented approach. Help Pepe find coins and salsa bottles to fight the killer chicken."
  },
  "CONTACT": {
    "FIRST": "You have a future project?",
    "SECOND": "Contact me and we can discuss the ideas.",
    "REQUIRED1": "Please enter your first and last name",
    "REQUIRED2": "Please enter a valid email address",
    "REQUIRED3": "Your message needs to be at least 10 characters long",
    "POLICY1": "I have read the",
    "POLICY2": "privacy policy",
    "POLICY3": "and agree to the processing of my data as described.",
    "REQUIRED4": "Please accept the privacy policy.",
    "SUBMIT": "Send Mail",
    "INFO": "Your mail was sent."
  },
  "FOOTER": {
    "FIRST": "Privacy policy",
    "SECOND": "Imprint"
  },
  "PRIVACY_POLICY": {
    "text01": "Privacy Policy",
    "text02": "1. Data Protection at a Glance",
    "text03": "General Notes",
    "text04": "The following provides a simple overview of what happens to your personal data when you visit this website. Personal data are all data with which you could be personally identified. Detailed information on the subject of data protection can be found in our privacy policy listed below this text.",
    "text05": "Data Collection on This Website",
    "text06": "Who is responsible for the data collection on this website?",
    "text07": "The data processing on this website is carried out by the website operator. The operator's contact details can be found in the 'Notice Concerning the Responsible Party' section of this privacy policy.",
    "text08": "How do we collect your data?",
    "text09": "Your data is collected in part by us providing it to us. This could, for example, be data you enter on a contact form.",
    "text10": "Other data is collected automatically by our IT systems when you visit the website. These are primarily technical data such as the browser and operating system you are using or when you accessed the page. This data is collected automatically as soon as you enter our website.",
    "text11": "What do we use your data for?",
    "text12": "Some of the data is collected to ensure the proper functioning of the website. Other data can be used to analyze how visitors use the site.",
    "text13": "What rights do you have regarding your data?",
    "text14": "You always have the right to request information about your stored data, its origin, its recipients, and the purpose of its collection at no charge. You also have the right to request that it be corrected, blocked, or deleted. You can contact us at any time using the address given in the legal notice if you have further questions about the issue of privacy and data protection. You may also, of course, file a complaint with the competent regulatory authorities.",
    "text15": "Analytics and third-party tools",
    "text16": "When visiting our website, statistical analyses may be made of your surfing behavior. This happens primarily using cookies and analytics. The analysis of your surfing behavior is usually anonymous, i.e., we will not be able to identify you from this data. You can object to this analysis or prevent it by not using certain tools. Detailed information can be found in the following privacy policy.",
    "text17": "2. Hosting",
    "text18": "We host our website with the following provider:",
    "text19": "All-Inkl",
    "text20": "Provider is ALL-INKL.COM - Neue Medien Münnich, Inh. René Münnich, Hauptstraße 68, 02742 Friedersdorf (hereinafter All-Inkl). For details, see the privacy policy of All-Inkl:",
    "text21": "The use of All-Inkl is based on Art. 6(1)(f) GDPR. We have a legitimate interest in a technically flawless and efficient provision of our website. If a corresponding consent has been requested, processing takes place exclusively on the basis of Art. 6(1)(a) GDPR and § 25(1) TDDDG, to the extent the consent includes the storage of cookies or access to information in the user’s terminal device (e.g., device fingerprinting) under TDDDG. Consent can be revoked at any time.",
    "text22": "Data Processing Agreement",
    "text23": "We have concluded a data processing agreement (DPA) with the service provider mentioned above. This is a legally required contract ensuring that this service provider processes personal data of our website visitors only according to our instructions and in compliance with the GDPR.",
    "text24": "3. General Information and Mandatory Information",
    "text25": "Data Protection",
    "text26": "The operators of these pages take the protection of your personal data very seriously. We treat your personal data as confidential and in accordance with the statutory data protection regulations and this privacy policy.",
    "text27": "If you use this website, various pieces of personal data will be collected. Personal information is any data with which you could be personally identified. This privacy policy explains what information we collect and what we use it for. It also explains how and for what purpose this happens.",
    "text28": "Please note that data transmitted via the internet (e.g., via email communication) may be subject to security breaches. Complete protection of your data from third-party access is not possible.",
    "text29": "Responsible Party",
    "text30": "The responsible party for data processing on this website is:",
    "text34": "Email: s.lenz(a)sascha-lenz.org",
    "text35": "The responsible party is the natural or legal person who alone or jointly with others decides on the purposes and means of processing personal data (names, email addresses, etc.).",
    "text36": "Data Retention Period",
    "text37": "Unless a specific storage period is specified in this privacy policy, your personal data will remain with us until the purpose for which it was collected no longer applies. If you assert a rightful request for deletion or revoke your consent to data processing, your data will be deleted unless we have other legally permissible reasons for storing your personal data (e.g., tax or commercial retention periods); in the latter case, deletion will occur once these reasons cease to apply.",
    "text38": "General Information on Data Processing Legal Bases",
    "text39": "If you have given consent to the processing of your data, you can revoke it at any time. The lawfulness of the data processing carried out before the revocation remains unaffected by the revocation. In the event of consent to the transfer of personal data to third countries, the processing is carried out on the basis of Art. 49(1)(a) GDPR. If you have consented to the storage of cookies or access to information on your terminal device (e.g., via device fingerprinting), the processing will also take place on the basis of § 25(1) TDDDG. Consent can be revoked at any time. If your data is necessary for the fulfillment of a contract or for the implementation of pre-contractual measures, we will process your data based on Art. 6(1)(b) GDPR. Furthermore, we process your data if this is necessary to fulfill a legal obligation based on Art. 6(1)(c) GDPR. Data processing may also be based on our legitimate interests under Art. 6(1)(f) GDPR. Information on the relevant legal bases will be provided in the individual sections of this privacy policy.",
    "text40": "Recipients of Personal Data",
    "text41": "In the course of our business activities, we cooperate with various external entities. In some cases, personal data is transmitted to these external entities. We only pass on personal data to external entities if it is necessary within the scope of contract performance, if we are legally obliged to do so (e.g., disclosure of data to tax authorities), if we have a legitimate interest pursuant to Art. 6(1)(f) GDPR in the transfer, or if another legal basis allows data transfer. When using processors, we only pass on personal data of our customers based on a valid data processing agreement. In the case of joint processing, a joint processing agreement is concluded.",
    "text42": "Revocation of Your Consent to Data Processing",
    "text43": "Many data processing operations are only possible with your express consent. You can revoke your consent at any time. The legality of the data processing carried out until the revocation remains unaffected by the revocation.",
    "text44": "Right to Object to Data Collection in Special Cases and Direct Marketing (Art. 21 GDPR)",
    "text45": "If data processing is based on Art. 6(1)(e) or (f) GDPR, you have the right to object to the processing of your personal data for reasons arising from your particular situation, including profiling based on these provisions. The respective legal basis on which processing is based can be found in this privacy policy. If you object, we will no longer process your personal data unless we can demonstrate compelling legitimate grounds for the processing that outweigh your interests, rights, and freedoms or the processing serves to assert, exercise, or defend legal claims (objection pursuant to Art. 21(1) GDPR).",
    "text46": "If your personal data is processed for direct marketing purposes, you have the right to object at any time to the processing of your personal data for such marketing, including profiling to the extent that it is related to such direct marketing. If you object, your personal data will subsequently no longer be used for direct marketing purposes (objection pursuant to Art. 21(2) GDPR).",
    "text47": "Right to Lodge a Complaint with the Supervisory Authority",
    "text48": "In the event of violations of the GDPR, data subjects have the right to lodge a complaint with a supervisory authority, in particular in the Member State of their habitual residence, place of work, or place of the alleged infringement. The right to lodge a complaint is without prejudice to other administrative or judicial remedies.",
    "text49": "Right to Data Portability",
    "text50": "You have the right to have data which we process automatically based on your consent or in fulfillment of a contract handed over to yourself or to a third party in a standard, machine-readable format. If you request the direct transfer of the data to another controller, this will only be done if it is technically feasible.",
    "text51": "Information, correction and deletion",
    "text52": "Within the scope of applicable legal provisions, you have the right to obtain free information at any time about your stored personal data, their origin and recipients and the purpose of data processing, and, if applicable, a right to rectification or erasure of this data. For this purpose and for any further questions regarding personal data, you can contact us at any time.",
    "text53": "Right to restriction of processing",
    "text54": "You have the right to request the restriction of processing of your personal data. For this purpose, you can contact us at any time. The right to restriction of processing exists in the following cases:",
    "text55": "If you dispute the accuracy of your personal data stored by us, we usually need time to verify this. During the verification period, you have the right to request the restriction of processing of your personal data.",
    "text56": "If the processing of your personal data was/is unlawful, you can request the restriction of data processing instead of deletion.",
    "text57": "If we no longer need your personal data, but you need it for the exercise, defense, or assertion of legal claims, you have the right to request the restriction of processing of your personal data instead of deletion.",
    "text58": "If you have objected pursuant to Art. 21(1) GDPR, an assessment must be made between your interests and ours. As long as it is not yet clear whose interests prevail, you have the right to request the restriction of processing of your personal data.",
    "text59": "If you have restricted the processing of your personal data, these data - apart from their storage - may only be processed with your consent or for the establishment, exercise, or defense of legal claims or for the protection of the rights of another natural or legal person or for reasons of important public interest of the European Union or a Member State.",
    "text60": "SSL or TLS encryption",
    "text61": "For security reasons and to protect the transmission of confidential content, such as orders or inquiries that you send to us as the site operator, this site uses SSL or TLS encryption. You can recognize an encrypted connection by the fact that the address line of the browser changes from \"http://\" to \"https://\" and by the lock symbol in your browser line.",
    "text62": "When SSL or TLS encryption is activated, the data you transmit to us cannot be read by third parties.",
    "text63": "Source:"
  },
  "IMPRINT": {
    "text01": "Imprint",
    "text02": "Contact",
    "text03": "Source:"
  }
}
